// 1216.cpp : 이 파일에는 'main' 함수가 포함됩니다. 거기서 프로그램 실행이 시작되고 종료됩니다.
//

#include <iostream>

int main()
{
    std::cout << "제가 가장 즐겁게 했던 게임은 '데스티니 가디언즈' 입니다. 그렇기에 '데스티니 가디언즈'에 대해서 소개하겠습니다." << std::endl << std::endl;
    std::cout << "'데스티니 가디언즈'는 MMORPG + FPS 장르를 가지고 있습니다." << std::endl << std::endl;
    std::cout << "일반적인 타 FPS 장르를 가진 게임과 달리, 'PVE' 컨텐츠가 주를 이루는 게임입니다." << std::endl << std::endl;
    std::cout << "대략적인 스토리로는 다른 외부 세력으로부터 공격을 받은 도시를" << std::endl << std::endl;
    std::cout << "'수호자'라 칭하는 플레이어들이 도시를 되찾기 위해, 맞서 싸운다는 내용입니다." << std::endl << std::endl;
    std::cout << "위 게임의 컨텐츠로는 'PVP', 'PVE', '레이드''가 있습니다." << std::endl << std::endl;
    std::cout << "위 게임은 전체적인 진입장벽은 낮지만, 게임 내 최고 아이템 등급인 '경이' 아이템을 획득하기 까지 많은 시간이 소요되고," << std::endl << std::endl;
    std::cout << "'레이드' 컨텐츠 플레이 시, 음성채팅이 강요된다는 점, 게임이 다소 불친절하고 숨겨진 요소가 많아," << std::endl << std::endl;
    std::cout << "정보 검색에 많은 시간을 들여야 한다는 점 때문에 호불호가 많이 갈리는 게임입니다." << std::endl << std::endl;
    std::cout << "반대로, 숨겨진 요소를 찾거나 팀원들과의 소통을 좋아하는 분이라면 꽤 재미있게 플레이 할 수 있는 게임이라 생각합니다." << std::endl << std::endl;
    
    std::cout << "작성자 : 김범호" << std::endl;

    return 0;
}

// 프로그램 실행: <Ctrl+F5> 또는 [디버그] > [디버깅하지 않고 시작] 메뉴
// 프로그램 디버그: <F5> 키 또는 [디버그] > [디버깅 시작] 메뉴

// 시작을 위한 팁: 
//   1. [솔루션 탐색기] 창을 사용하여 파일을 추가/관리합니다.
//   2. [팀 탐색기] 창을 사용하여 소스 제어에 연결합니다.
//   3. [출력] 창을 사용하여 빌드 출력 및 기타 메시지를 확인합니다.
//   4. [오류 목록] 창을 사용하여 오류를 봅니다.
//   5. [프로젝트] > [새 항목 추가]로 이동하여 새 코드 파일을 만들거나, [프로젝트] > [기존 항목 추가]로 이동하여 기존 코드 파일을 프로젝트에 추가합니다.
//   6. 나중에 이 프로젝트를 다시 열려면 [파일] > [열기] > [프로젝트]로 이동하고 .sln 파일을 선택합니다.
